{
  "link": "https://neo.ubs.com/shared/q6aUrYt0Mp9/?did=FG4-I--2187800667&off_id=FG4-I-24727537945ma=B0H8999129599899&amp_id=EM:ECON:2025-11:25:",
  "document_title": "JPMorgan Economic Outlook 2026: Soft landing scenario with gradual normalization",
  "document_content": "JPMorgan Economics released its 2026 outlook, forecasting a soft landing with gradual policy normalization. US GDP growth is projected at 2.2% for 2026, slightly above trend, supported by resilient consumer spending and business investment recovery. The unemployment rate is expected to edge up to 4.3% from current 3.7%, representing healthy labor market normalization rather than deterioration. Inflation is forecast to continue its disinflationary path, with headline CPI averaging 2.4% and core PCE reaching 2.3% by year-end 2026, approaching but not quite reaching the Fed's 2% target. The Federal Reserve is expected to cut rates by 100 bps cumulatively through 2026, bringing the fed funds rate to 4.25-4.50% by December 2026. The easing cycle will be gradual and data-dependent, with cuts likely back-end loaded as the Fed confirms inflation sustainably declining. On the fiscal side, deficit concerns persist with federal deficit projected at 6.5% of GDP, requiring eventual consolidation but unlikely to occur in an election year. Corporate earnings are forecast to grow 8-10% in 2026, supported by revenue growth and modest margin expansion as input cost pressures ease. The housing market should stabilize with mortgage rates declining toward 6%, improving affordability modestly. Global growth is projected at 3.1%, with China at 4.5%, Eurozone at 1.3%, and emerging markets at 4.0%. Key risks include: geopolitical escalation (Middle East, China-Taiwan), financial stability concerns from high debt levels, policy errors by central banks, and political uncertainty. The base case assumes no major shocks and continued AI-driven productivity gains. Sector implications: banks benefit from higher-for-longer rates but face NIM compression as cuts begin; technology continues strong on AI momentum; consumer discretionary faces headwinds from higher unemployment; and healthcare remains defensive with stable growth.",
  "metadata": {
    "author": "Michael Feroli, PhD, Chief US Economist",
    "sector": "Economics",
    "region": "United States",
    "date": "2025-11-25",
    "wire_id": "eco82956",
    "subject_codes": ["ECON", "MACRO", "FORECAST"]
  },
  "expected_summary": "JPMorgan forecasts 2026 US GDP growth of 2.2%, slightly above trend, with unemployment rising to 4.3% as labor market normalizes. Inflation expected to continue declining, with headline CPI at 2.4% and core PCE reaching 2.3% by year-end, approaching Fed's 2% target. Federal Reserve projected to cut rates by 100 bps cumulatively through 2026, bringing fed funds to 4.25-4.50%. Easing cycle will be gradual and data-dependent, back-end loaded. Federal deficit forecast at 6.5% of GDP; consolidation needed but unlikely in election year. Corporate earnings expected to grow 8-10%, supported by revenue growth and margin expansion. Housing market stabilizing with mortgage rates declining toward 6%. Global growth projected at 3.1% (China 4.5%, Eurozone 1.3%). Key risks include geopolitical tensions, financial stability concerns from high debt, central bank policy errors, and political uncertainty.",
  "generated_summary": "JPMorgan's 2026 economic outlook projects a soft landing with gradual normalization. US GDP growth forecast at 2.2% (above trend), unemployment rising to 4.3% reflecting healthy labor market normalization. Inflation continues disinflationary path: headline CPI 2.4%, core PCE 2.3% by year-end (approaching Fed's 2% target). Federal Reserve expected to deliver 100 bps of rate cuts through 2026, bringing fed funds to 4.25-4.50%, with easing concentrated in H2 2026. Fiscal deficit remains elevated at 6.5% of GDP. Corporate earnings projected +8-10%, housing market stabilizes as mortgage rates decline toward 6%. Global growth 3.1% (China 4.5%, Eurozone 1.3%). Risks: geopolitical escalation, financial stability concerns from high debt, policy errors, political uncertainty. Sector views: banks benefit from higher-for-longer but face NIM pressure; tech strong on AI; consumer discretionary challenged by unemployment; healthcare defensive.",
  "prompt_type": "Morning Summary Economics",
  "model_used": "gpt-4o",
  "export_timestamp": "2025-11-25T08:45:33.776542"
}
