{
  "link": "https://neo.ubs.com/shared/d2hzDbPdABb51J/?did=AC7-E--2183000278&off_id=AC7-E-24685153128ma=X6D4555785155455&amp_id=EM:UNKW:2025-11:14:",
  "document_title": "RLX Technology: Q325 strong beat across lines driven by organic growth and strategic investment",
  "document_content": "How did the results compare vs expectations? RLX reported Q325 rev. / GP / adj.NP of Rmb1,129.3mn / Rmb352.6mn / Rmb295.4mn, up 49% YoY / 71% YoY / 12% YoY, beating consensus estimates by 6% / 20% / 2%. Q325 GPM expanded by 4ppts YoY to 31.2%, mainly due to the consolidation of RLX's acquisition of TW, a favourable change in geographic revenue mix, and GPM improvement in key overseas markets per mgmt. OPEX in Q3 increased 20% YoY to Rmb259.3mn, driven by higher salaries and shipping expenses related to S&D that were partially offset by lower SBC expenses. This led to Q3 OP of Rmb93.3mn, with OPM expanding by 9.7ppts YoY to 8%. We note that RLX's Q3 interest income decreased by c10% YoY due to lower interest rate. RLX declared a cash dividend of US$0.1 per ADS, payment expected in Feb 2026. As of Q325, RLX has cumulatively repurchased 170mn shares for a total of US$330mn. What were the most noteworthy areas of the results? China rev. was Rmb820mn in Q3, up 10% QoQ and c25% YoY, mainly due to the Chinese government's continued crackdown on reimported illicit vapes and accelerated inventory shipment. Export rev. was Rmb300mn in Q3, up 11% QoQ. Export business segment's GPM expanded to 20% in the quarter due to the increased proportion of production facilities and robust UK performance amid the disposable ban. Mgmt plans to adopt a differentiated product strategy, e.g., differentiated brands in various markets, but expects limited revenue contribution in near-term. Has the company's guidance / outlook changed? For Q4 2025, mgmt expects revenue to remain broadly flattish QoQ, driven by a 30-40 % QoQ decline in China due to inventory shipment in Q3, offset by low DDX revenue growth in overseas market, while GPM remains 30-32%. For 2026, mgmt targets above-industry organic growth of c20% YoY, driven by 25-30% YoY in APAC overseas markets and 10-15% YoY in China. Mgmt is also actively exploring strategic investment opportunities in key geographies. How do we expect investors to react? We expect the market to react positively to the strong beat. Our DCF-based PT of US$2.85 implies 17x/13x 2025E/2026E EV/EBITDA with a 28% 2025-27E EBITDA CAGR. {'Company Name': 'RLX Technology13,16,28', 'Reuters': 'RLX.N', '12-month Rating': 'Buy', 'Price': 'US$2.33', 'Price Date': '14 Nov 2025'}",
  "metadata": {
    "author": "Christine Peng, CFA, Analyst",
    "sector": "Tobacco",
    "region": "",
    "date": "2025-11-24",
    "wire_id": "ueh13036",
    "subject_codes": []
  },
  "expected_summary": "**RLX Technology (UBS Research Rec Buy) - Q325 strong beat across lines driven by organic growth and strategic investment Report RLX reported Q325 rev. / GP / adj.NP of Rmb1,129.3mn / Rmb352.6mn / Rmb295.4mn, up 49% YoY / 71% YoY / 12% YoY, beating consensus estimates by 6% / 20% / 2%. Q325 GPM expanded by 4ppts YoY to 31.2%, mainly due to the consolidation of RLX's acquisition of TW, a favourable change in geographic revenue mix, and GPM improvement in key overseas markets per mgmt. OPEX in Q3 increased 20% YoY to Rmb259.3mn, driven by higher salaries and shipping expenses related to S&D that were partially offset by lower SBC expenses. This led to Q3 OP of Rmb93.3mn, with OPM expanding by 9.7ppts YoY to 8%. We note that RLX's Q3 interest income decreased by c10% YoY due to lower interest rate. RLX declared a cash dividend of US$0.1 per ADS, payment expected in Feb 2026. As of Q325, RLX has cumulatively repurchased 170mn shares for a total of US$330mn.",
  "generated_summary": "## Summary for RLX Technology (Buy) **Results vs Expectations:** RLX's Q3 revenue, gross profit, and adjusted net profit of Rmb1,129.3mn (+49% YoY), Rmb352.6mn (+71% YoY), and Rmb295.4mn (+12% YoY) exceeded consensus by 6%, 20%, and 2%, respectively. Gross profit margin expanded 4ppts YoY to 31.2%, aided by the TW acquisition, favourable geographic mix, and improvements in key overseas markets. Operating profit reached Rmb93.3mn, with operating margin expanding by 9.7ppts YoY to 8%. Driest income dropped <10% YoY due to lower rates. A US$0.1 cash dividend per ADS was declared, payable in February 2026. RLX has repurchased 170mn shares for US$330mn cumulatively. **Noteworthy Areas:** China revenue grew ~25% YoY in Q3, supported by governmental action on illicit vapes and inventory shipment acceleration. Overseas revenue surged ~60% QoQ, fueled by TW's acquisition and robust UK performance amid the disposable ban. Export GPM expanded to 20% in disposable products. Mgmt plans to adopt a differentiated product strategy and direct sales in selective regions. Positive growth trends in South Korea (franchise model scaling) and Indonesia (stronger retail channel), alongside oral product launches in select markets, highlight operational strengths. **Guidance Update:** Management expects Q4 2025 revenue to remain flat QoQ, as ~30-40% QoQ China shipment decline is offset by low DDX growth overseas. For 2026, mgmt targets ~20% YoY organic growth, driven by 25-30% growth in APAC and mid-to-high single-digit investments in China, alongside strategic investments in key geographies. **Investor Reaction:** Strong Q3 beat and positive dynamics are likely well received. Price target (DCF-based) is US$2.85, implying 28% EBITDA CAGR (2025-2027E) and 17x/13x 2025/2026 EV/EBITDA.",
  "prompt_type": "Morning Summary Stock",
  "model_used": "gpt-4o",
  "export_timestamp": "2025-11-24T16:23:40.119022"
}
