{
  "link": "https://neo.ubs.com/shared/p5zTqXs9No8/?did=EF3-H--2186700556&off_id=EF3-H-24716426834ma=A9G7888018488788&amp_id=EM:AUTO:2025-11:22:",
  "document_title": "Tesla Inc: Q4 2024 results show delivery growth but margin pressure persists",
  "document_content": "Tesla reported Q4 2024 revenue of $25.7 billion, up 3% year-over-year but below Street estimates of $27.2 billion. Automotive revenue reached $21.6 billion, while Energy Generation and Storage contributed $2.4 billion (+10% YoY). Services revenue was $1.7 billion. Vehicle deliveries totaled 484,500 units in Q4, up 2% YoY, with Model 3/Y accounting for 439,000 units and Model S/X/Cybertruck for 45,500 units. Gross margin compressed to 17.6% from 23.8% in Q4 2023, primarily due to aggressive pricing actions to stimulate demand and increased production costs. Automotive gross margin excluding regulatory credits fell to 14.2%. Operating income was $2.0 billion with operating margin of 7.8%, down from 16.3% a year ago. Net income reached $1.9 billion, or $0.60 per diluted share, compared to $3.7 billion or $1.19 per share in Q4 2023. Free cash flow was $2.1 billion for the quarter. CEO Elon Musk stated that 2025 will be a transition year as the company prepares for next-generation vehicle platform launch and expands AI/autonomous capabilities. Management guided to vehicle delivery growth of 20-30% in 2025, assuming successful ramp of new products. Energy storage deployments are expected to grow significantly, with production capacity expanding to 100 GWh annually. On the autonomy front, Full Self-Driving (FSD) supervision is now available in multiple countries, with 1.5 million active users. The company aims to launch robotaxi service in select cities by late 2025, pending regulatory approval. Capex guidance for 2025 is $8-10 billion, focused on AI compute infrastructure, battery production, and new vehicle programs. Key concerns include: sustained margin pressure from pricing competition, execution risk on next-gen platform, regulatory uncertainty for autonomous vehicles, and increasing competition in both EVs and energy storage. Bulls point to growing energy business, AI/autonomy optionality, and strong brand positioning. Bears cite declining profitability, demand uncertainty, and execution challenges across multiple initiatives.",
  "metadata": {
    "author": "Patrick Hummel, CFA, Autos & Mobility Analyst",
    "sector": "Automotive",
    "region": "Global",
    "date": "2025-11-22",
    "wire_id": "aut58372",
    "subject_codes": ["AUTO", "TECH", "EARNINGS"]
  },
  "expected_summary": "Tesla reported Q4 2024 revenue of $25.7B (+3% YoY), missing Street estimates of $27.2B. Vehicle deliveries reached 484.5K units (+2% YoY), with Model 3/Y at 439K units. Gross margin compressed to 17.6% from 23.8% YoY, driven by pricing actions and higher costs. Automotive gross margin ex-credits fell to 14.2%. Operating margin declined to 7.8% from 16.3%, with operating income of $2.0B. Net income was $1.9B ($0.60/share) vs $3.7B ($1.19/share) YoY. Free cash flow reached $2.1B. Management guided to 20-30% delivery growth in 2025, contingent on new product ramps. Energy storage deployments expected to grow significantly, targeting 100 GWh production capacity. FSD supervision now available globally with 1.5M active users; robotaxi launch targeted for late 2025. Capex guidance of $8-10B for 2025, focused on AI infrastructure and new vehicles.",
  "generated_summary": "## Tesla Q4 2024 Results: Delivery Growth Amid Margin Pressure\n\n**Financial Performance:** Tesla delivered Q4 revenue of $25.7B (+3% YoY), below consensus of $27.2B. Automotive revenue contributed $21.6B, Energy Generation $2.4B (+10% YoY), and Services $1.7B. Vehicle deliveries totaled 484.5K units (+2% YoY), comprising 439K Model 3/Y and 45.5K Model S/X/Cybertruck.\n\n**Margin Compression:** Gross margin contracted sharply to 17.6% from 23.8% YoY, reflecting aggressive pricing to stimulate demand and elevated production costs. Automotive gross margin excluding regulatory credits dropped to 14.2%. Operating margin fell to 7.8% from 16.3%, with operating income of $2.0B. Net income declined to $1.9B ($0.60/share) from $3.7B ($1.19/share) YoY. FCF remained solid at $2.1B.\n\n**2025 Outlook & Strategic Priorities:** Management projects 20-30% delivery growth in 2025, dependent on successful new product launches. Energy storage business poised for significant expansion, targeting 100 GWh annual production capacity. Autonomy progress continues with FSD supervision deployed globally (1.5M active users) and robotaxi service targeted for late 2025 launch in select cities. Capex guidance of $8-10B allocated to AI compute, battery production, and next-gen vehicles.\n\n**Investment Considerations:** Key risks include sustained margin pressure from pricing competition, execution challenges on next-generation platform, regulatory hurdles for autonomous offerings, and intensifying competition in EVs and energy storage. Positive factors include growing energy business contribution, AI/autonomy optionality, and brand strength.",
  "prompt_type": "Research Note",
  "model_used": "gpt-4o",
  "export_timestamp": "2025-11-22T18:32:15.553891"
}
